-- Выберите сумму зарплат по отделам из таблицы сотрудников и преобразуйте полученное значение в строку с денежной маской.

select d.department_name,
       to_char(sum(e.salary),'$999G999')
from   employees e
join   departments d on 
       d.department_id = e.department_id
group by d.department_name
order by 2 desc

------------------------------------------------------------------------------------------------------------------------------------
-- Преобразуйте дату найма сотрудников из таблицы сотрудников до первого января года найма.

SELECT employee_id,
       last_name,
       first_name,
       hire_date,
       trunc (hire_date, 'yyyy') as first_year_date
FROM employees 
order by 1

------------------------------------------------------------------------------------------------------------------------------------
-- Отдельным запросом преобразуйте полученные значения в задании 2 в текст со значением года.

SELECT employee_id,
       last_name,
       first_name,
       hire_date,
       to_char (trunc (hire_date, 'yyyy'), 'yyyy') as year_txt
FROM employees 
order by 1

------------------------------------------------------------------------------------------------------------------------------------
-- Отдельным запросом преобразуйте полученные значения в задании 2 в число со значением года.

SELECT employee_id,
       last_name,
       first_name,
       hire_date,
       to_number(to_char (trunc (hire_date, 'yyyy'), 'yyyy')) as year_num
FROM employees 
order by 1

------------------------------------------------------------------------------------------------------------------------------------
-- Вычислите минимальный, максимальный и средний годы найма из данных задания 2.

SELECT max (to_number(to_char (trunc (hire_date, 'yyyy'), 'yyyy'))) as max_year,
       min (to_number(to_char (trunc (hire_date, 'yyyy'), 'yyyy'))) as min_year,
       avg (to_number(to_char (trunc (hire_date, 'yyyy'), 'yyyy'))) as avg_year
FROM employees 

------------------------------------------------------------------------------------------------------------------------------------
-- Создайте таблицу hurricane (Справочник ураганов) с полями: name - текст на 64 символа (Наименование), report_year - дата (Год, в который приходил ураган), victims - число (Количество жертв).

create table hurricane (name varchar2(64),
                        report_year date,
                        victims number)
                        
------------------------------------------------------------------------------------------------------------------------------------
-- Наложить на поле наименования урагана ограничение использования метки null.

alter table hurricane modify name not null

------------------------------------------------------------------------------------------------------------------------------------
-- Очистить таблицу ураганов функцией truncate.

truncate table hurricane

------------------------------------------------------------------------------------------------------------------------------------
-- Удалить таблицу ураганов.

drop table hurricane


