------------------------------------------------------------------------------------------------------------------------------------
-- Домашнее задание урока 9

------------------------------------------------------------------------------------------------------------------------------------
-- 1 Удалить представление security.duty.

drop view security.duty_v

------------------------------------------------------------------------------------------------------------------------------------
-- 2 Удалить таблицу hr.duty.

drop table hr.duty

------------------------------------------------------------------------------------------------------------------------------------
-- 3. Создать таблицу security.duty с тремя полями:
--    id - автоинкрементное поле (id записи)
--    employee_id - число (идентификатор сотрудника)
--    duty_date - дата (дата дежурства)

create table security.duty (
             id number generated as identity, 
             employee_id number,
             duty_date date
             )

------------------------------------------------------------------------------------------------------------------------------------
-- 4. Дать права на чтение с возможностью передавать права дальше таблицы hr.employees схеме security.

grant select on HR.employees to security with grant option


------------------------------------------------------------------------------------------------------------------------------------
-- 5. Создать представление security.duty_employees на основе запроса с соединением таблиц hr.employees и security.duty по полю employee_id и выводом полей с натуральными значениями (без идентификаторов).

create view security.duty_employees
as
select e.first_name,
       e.last_name,
       e.email,
       e.phone_number,
       e.hire_date,
       e.salary,
       e.commission_pct,
       d.duty_date
from hr.employees e
join security.duty d on e.employee_id = d.employee_id





------------------------------------------------------------------------------------------------------------------------------------
-- Практика урока 9.4

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 1 Создайте последовательность counter.

create SEQUENCE counter

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 2 Выберите несколько раз следующее значение из последовательности counter.

select counter.nextval from dual

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 3 Выберите несколько раз текущее значение из последовательности counter.

select counter.currval from dual

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 4 Создайте таблицу inventory - таблицу инвентаря работников. Поля в этой таблице будут: equip_id - число, автоинкрементное (идентификатор оборудования), employee_id - число (идентификатор сотрудника), equip_name - текст на 256 символов.

create table inventory (
             equip_id number generated as identity, 
             employee_id number,
             equip_name varchar2 (256)
             )

------------------------------------------------------------------------------------------------------------------------------------
-- Практика урока 9.3

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 1 Дайте права схеме accountant на select к таблице hr.accounts (была создана в модуле 8, практике после урока 1).

grant select on hr.accounts to accountant

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 2 Создайте представление accounts в схеме accountant, основанную на запросе к таблице hr.accounts.

grant create view to accountant 

create or REPLACE view accountant.accounts_v
as 
select * from HR.accounts

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 3 Дайте права схеме security на select к таблице hr.duty и hr.employees_cars (были созданы в модуле 8, практике после урока 1).

grant select on hr.duty to security

grant select on hr.employee_cars to security


------------------------------------------------------------------------------------------------------------------------------------
-- Задание 4 Создайте представление duty и cars в схеме security, основанные на запросах к таблицам hr.duty и hr.employees_cars соответственно.

grant create view to security

create or REPLACE view security.duty_v
as 
select * from HR.duty

create or REPLACE view security.cars
as 
select * from HR.employee_cars




------------------------------------------------------------------------------------------------------------------------------------
-- Практика урока 9.2

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 1 Создайте схему accountant как показано в уроке.

create user accountant 
       identified by accountan1
       default tablespace sysaux
       temporary tablespace temp 
       account unlock;

alter user accountant quota unlimited on sysaux;

grant create session to accountant

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 2 Создайте схему security как показано в уроке.

create user security 
       identified by security1
       default tablespace sysaux
       temporary tablespace temp 
       account unlock;

alter user security quota unlimited on sysaux;

grant create session to security