------------------------------------------------------------------------------------------------------------------------------------
-- Практическая работа модуля 12

------------------------------------------------------------------------------------------------------------------------------------
-- 1. Исправьте листинг программы.

/* begin

    dbms_ouptut.put_line('Исправления вечны');

end */

begin
    dbms_output.put_line('Исправления вечны');
end;

------------------------------------------------------------------------------------------------------------------------------------
--  2. Исправьте листинг программы.

/* begin

    if round(dbms_random.value(0, 10), 2 <= 3 then

        dbms_output.put_line('БС1')

    elif round(dbms_random.value(0 10), 2) = 5 than

        dbms_ouptut.put_line('БС2');

    else

        dbms_output.put_line('счёт');

    end

end; */

begin
    if round(
           dbms_random.value(
               0, 
               10
            ), 
            2 
        ) <= 3 then
                  dbms_output.put_line('БС1');
    elsif round(
            dbms_random.value(
                0,
                10
            ), 
            2
        ) = 5 then
                  dbms_output.put_line('БС2');
    else
                  dbms_output.put_line('счёт');

    end if;
end; 

------------------------------------------------------------------------------------------------------------------------------------
-- 3. Напишите анонимный блок, в котором выбирается случайное количество яблок в отрезке [1, 5], и это число округляется до целого. 
-- Необходимо вывести на экран чётное или нечётное количество яблок.

declare
    v_random_apple number := round(dbms_random.value(1,5));
begin
    if v_random_apple / 2 = 1 then
        dbms_output.put_line(v_random_apple ||' ябл. - четное');
    elsif v_random_apple / 2 = 2 then
        dbms_output.put_line(v_random_apple ||' ябл. - четное');
    else      
        dbms_output.put_line(v_random_apple ||' ябл. - нечетное');
    end if;    
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Практика урока 12.5

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 1 Напишите анонимный блок с выводом случайного значения с ограничением от 0 до 5.

begin
    dbms_output.put_line(dbms_random.value(0,5));    
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 2 Добавьте округление до целых чисел случайного значения из задания 1.

begin
    dbms_output.put_line(round(dbms_random.value(0,5)));    
end;


------------------------------------------------------------------------------------------------------------------------------------
-- Задание 3 Напишите анонимный блок, в котором проверяется округленное случайное значение с ограничением от 0 до 5 на условие, что оно меньше трех. 
-- Если это истина, то выводится на экран сообщение “Первый пошел!”, если оно больше двух, то вывести  “Второй пошел!”.
-- В блоке “иначе” нужно вывести на экран сообщение “Пошел, пошел, пошел!”.

declare
    v_random_val number := round(dbms_random.value(0,5));
begin
    if v_random_val < 3 then
        dbms_output.put_line(v_random_val ||' Перый пошел!');
    elsif v_random_val > 2 then
        dbms_output.put_line(v_random_val ||' Второй пошел!');
    else      
        dbms_output.put_line(v_random_val ||' Пошел, пошел, пошел!');
    end if;    
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Практика урока 12.4

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 1 Напишите анонимный блок, в котором необходимо вывести в dbms_output сообщение “Hello world!” 
-- при условии, что значение числовой переменной равно 5. И после ветвления выведите на экран фразу “I've done!”.

declare 
    v_num number := 5;
begin
    if v_num = 5 then
        dbms_output.put_line('Hello world!');
    end if;
    dbms_output.put_line('I''ve done!');    
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 2 Попробуйте поменять значения в условии.

declare 
    v_num number := 5;
begin
    if v_num = 3 then
        dbms_output.put_line('Hello world!');
    end if;
    dbms_output.put_line('I''ve done!');    
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 3 Запустите программу с разными операторами сравнения, например, >, < >=, <=, !=.

declare 
    v_num number := 5;
begin
    if v_num > 3 then
        dbms_output.put_line('Hello world!');
    end if;
    dbms_output.put_line('I''ve done!');    
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Практика урока 12.3

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 1 Напишите анонимный блок, создайте в нем переменную со своим именем и выведите на экран приветствие с конкатенацией.
declare 
    v_name VARCHAR2(32) := 'Жека';
begin
    dbms_output.put_line('Hello, ' || v_name || '!');
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 2 Поменяйте переменную на константу и заполните ее другим именем.

declare 
    v_name constant VARCHAR2(32) := 'Саня';
begin
    dbms_output.put_line('Hello, ' || v_name || '!');
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 3 Напишите анонимный блок, создайте в нем константу, в которую положите название отдела и переменную с суммой зарплат сотрудников отдела.
-- Напишите запрос, в котором будут выбираться суммы зарплат отдела, а результат выведите на экран вида: 
-- 'Сумма заработных плат отдела '||переменная_отдела||' равняется '||переменная_зарплаты||' долларов'.

declare
    v_dep constant varchar2(32) := 'Marketing';
    v_sum number;
begin
    select sum(employees.salary)
    into
           v_sum
    from employees 
    join departments on employees.department_id = departments.department_id
    where departments.department_name = v_dep
    group by employees.department_id;
    dbms_output.put_line('Сумма заработных плат отдела '||v_dep||' равняется '||v_sum||' долларов');    
end;
 
------------------------------------------------------------------------------------------------------------------------------------
-- Практика урока 12.2

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 1 Напишите анонимный блок, в котором необходимо вывести в dbms_output сообщение 'Hello world!'.

begin
    dbms_output.put_line('Hello world!');
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 2 Напишите анонимный блок, в котором необходимо вывести в dbms_output сообщение Hello и Ваше имя с помощью конкатенации.

begin
    dbms_output.put_line('Hello, ' || 'Жека!');
end;

------------------------------------------------------------------------------------------------------------------------------------
-- Задание 3 Напишите анонимный блок, который выводил бы вот такое изображение, где в центре - ваше имя.

begin
    dbms_output.put_line('-----------------');
    dbms_output.put_line('|               |');
    dbms_output.put_line('|               |');
    dbms_output.put_line('|     Жека      |');
    dbms_output.put_line('|               |');
    dbms_output.put_line('|               |');
    dbms_output.put_line('-----------------');
end;
